# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

And here is a source for [Jupyter keyboard shortcuts](https://www.cheatography.com/weidadeyue/cheat-sheets/jupyter-notebook/) to help you format the notebooks in an efficient way.

# Import pandas, numpy, matplotlib and seaborn

In [1]:
# this will enable some additional autocompletion using the tab button

%config IPCompleter.greedy=True

In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [3]:
s = pd.Series([1.0,1.5,3.0,4.3,8.2])
s

0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [4]:
df = pd.DataFrame({
                   'a' : [2,3,4,5,6],
                   'b' : [3,1,9,12,2],
                   'c' : [5.,1.4,1.2,0.8,2.3],
                   'd' : ["horse","cat","dog","tortoise","rabbit"],
                'e' : [13,11, None, None,9]}, index=[1,2,3,4,5])
df

   a   b    c         d     e
1  2   3  5.0     horse  13.0
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN
5  6   2  2.3    rabbit   9.0

In [5]:
#acess individuall row with iloc

df.iloc[1]

a      3
b      1
c    1.4
d    cat
e     11
Name: 2, dtype: object

In [6]:
#access individual cell

df.iloc[2,3]
#OR
#print (df.loc[3, 'd'])

'dog'

In [7]:
#print the index and column names

print(df.index.values, df.columns.values)

[1 2 3 4 5] ['a' 'b' 'c' 'd' 'e']

In [8]:
#access specific column by column name

df['a']

1    2
2    3
3    4
4    5
5    6
Name: a, dtype: int64

In [9]:
#rename colum
df_renamed = df.rename(columns={'a': 'A', 'b': 'B', 'c': 'C', 'd': 'D', 'e': 'E'})
df_renamed

   A   B    C         D     E
1  2   3  5.0     horse  13.0
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN
5  6   2  2.3    rabbit   9.0

In [10]:
#extract rows 2-4 as new dataframe
df2 = df.iloc[1:4] 
df2

   a   b    c         d     e
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN

In [11]:
#extract columns
df.loc[:,'b':'d']

    b    c         d
1   3  5.0     horse
2   1  1.4       cat
3   9  1.2       dog
4  12  0.8  tortoise
5   2  2.3    rabbit

In [12]:
#Summary table
df.describe()

              a          b         c     e
count  5.000000   5.000000  5.000000   3.0
mean   4.000000   5.400000  2.140000  11.0
std    1.581139   4.827007  1.690562   2.0
min    2.000000   1.000000  0.800000   9.0
25%    3.000000   2.000000  1.200000  10.0
50%    4.000000   3.000000  1.400000  11.0
75%    5.000000   9.000000  2.300000  12.0
max    6.000000  12.000000  5.000000  13.0

# Data Import

Import the following file into a dataframe _df2_:

Integrated_Bioinformatics/example_data/example_df.csv

In [13]:
df2 = pd.read_csv('../example_data/example_df.csv')
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

Integrated_Bioinformatics/example_data/example_df2.csv

In [14]:
#Change separater
df3 = pd.read_csv('../example_data/example_df2.csv', sep=";")
df3

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [15]:
#select rows containing values greater than 2 in the 3rd column

#df.query('c>2')
#OR
df3.loc[df3['c']>2]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
4  6  2  2.3  rabbit   9.0

In [16]:
#select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column

df3.loc[(df3['c']>2)|(df3['d'] =='cat')]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [17]:
#drop rows with missing data

df3.dropna()

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [18]:
#drop duplicate rows

df3.drop_duplicates()

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [19]:
#drop 1st column from dataframe

df3.drop('a', axis=1)

    b    c         d     e
0   3  5.0     horse  13.0
1   1  1.4       cat  11.0
2   9  1.2       dog   NaN
3  12  0.8  tortoise   NaN
4   2  2.3    rabbit   9.0

In [20]:
#sort rows by 2nd column

df3.sort_values('b')

   a   b    c         d     e
1  3   1  1.4       cat  11.0
4  6   2  2.3    rabbit   9.0
0  2   3  5.0     horse  13.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN

In [21]:
#convert Strings in 4th column to title-case
df3['d'].str.title()

#OR
#df3['d'].apply(capitalize)

#def capitalize(input)
#    return input.title()

#OR
#df3['d'].apply(lambda x : x.title())

0       Horse
1         Cat
2         Dog
3    Tortoise
4      Rabbit
Name: d, dtype: object

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [22]:
df3.to_csv('df.txt', sep="\t", index = False)

# DataFrame aggregation

Read in df4 from IntegratedBioinformatics/example_data/df4.csv

In [23]:
df4 = pd.read_csv('../example_data/df4.csv')

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [24]:
df4.groupby('b').count().reset_index()

         b  c  d  e
0     fish  3  3  1
1   mammal  3  3  2
2  reptile  1  1  1

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [25]:
#merge with inner join

pd.merge(df3, df4, how='inner', on=['c', 'd', 'e'])

   a  b_x    c      d     e     b_y
0  2    3  5.0  horse  13.0  mammal
1  3    1  1.4    cat  11.0  mammal
2  4    9  1.2    dog   NaN  mammal

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [26]:
#merge outer join

pd.merge(df3, df4, how='outer', on=['c', 'd', 'e'])

     a   b_x    c         d     e      b_y
0  2.0   3.0  5.0     horse  13.0   mammal
1  3.0   1.0  1.4       cat  11.0   mammal
2  4.0   9.0  1.2       dog   NaN   mammal
3  5.0  12.0  0.8  tortoise   NaN      NaN
4  6.0   2.0  2.3    rabbit   9.0      NaN
5  NaN   NaN  0.1  goldfish   NaN     fish
6  NaN   NaN  2.3     snake   9.0  reptile
7  NaN   NaN  1.8       koi  10.0     fish
8  NaN   NaN  0.8      carp   NaN     fish